corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/nwk_ip/app/common/app_led.c
/*
 * Copyright (c) 2014 - 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */


/*!=================================================================================================
\file       app_led.c
\brief      This is a public source file for the application led configuration
==================================================================================================*/

/*==================================================================================================
Include Files
==================================================================================================*/
#include "app_stack_config.h"
#include "app_led.h"

#include "board.h"
#include "fsl_gpio.h"

#include "router_eligible_device_app_ota_client.h"

/*==================================================================================================
Private macros
==================================================================================================*/
/* LED configuration */
#define LedCfg_Off(ledId)                                       ledId, 0, 0, 0, 0, 0
#define LedCfg_On(ledId)                                        ledId, (gLedSetup_On_c), 0, 0, 0, 0
#define LedCfg_Toggle(ledId, state)                             ledId, ((state)?0:gLedSetup_On_c), 0, 0, 0, 0
#define LedCfg_Chasing(ledId)                                   ledId, (gLedSetup_Chasing_c), 0, 0, 0, 0
#define LedCfg_PeriodChasing(ledId, flashPeriod)                ledId, (gLedSetup_Chasing_c|gLedSetup_FlashPeriod_c),  0, 0, 0, flashPeriod
#define LedCfg_Flashing(ledId)                                  ledId, (gLedSetup_On_c|gLedSetup_Flashing_c),0, 0, 0, 0
#define LedCfg_PeriodFlashing(ledId, flashPeriod)               ledId, (gLedSetup_Flashing_c|gLedSetup_FlashPeriod_c), 0, 0, 0, flashPeriod
#define LedCfg_NotUsed(ledId)                                   gLedId_Undefined_c, 0, 0, 0, 0, 0


#if gLedRgbEnabled_d
#define LedCfg_Red(ledId, rgb, rValue)                          ledId, (gLedSetup_Red_c)|(gLedSetup_Rgb_c & rgb),  rValue, 0, 0, 0
#define LedCfg_Green(ledId, rgb, gValue)                        ledId, (gLedSetup_Green_c)|(gLedSetup_Rgb_c & rgb),0, gValue, 0, 0
#define LedCfg_Blue(ledId, rgb, bValue)                         ledId, (gLedSetup_Blue_c)|(gLedSetup_Rgb_c & rgb), 0, 0, bValue, 0
#define LedCfg_RGB(ledId, rgb, rValue, gValue, bValue)          ledId, (gLedSetup_Red_c)|(gLedSetup_Green_c)|(gLedSetup_Blue_c)| (gLedSetup_Rgb_c & rgb), rValue, gValue, bValue, 0
#define LedCfg_RedFlashing(ledId, rgb, rValue)                  ledId, (gLedSetup_Flashing_c)|(gLedSetup_Red_c)|(gLedSetup_Rgb_c & rgb), rValue, 0, 0, 0
#define LedCfg_GreenFlashing(ledId, rgb, gValue)                ledId, (gLedSetup_Flashing_c)|(gLedSetup_Green_c)|(gLedSetup_Rgb_c & rgb), 0, gValue, 0, 0
#define LedCfg_BlueFlashing(ledId, rgb, bValue)                 ledId, (gLedSetup_Flashing_c)|(gLedSetup_Blue_c)| (gLedSetup_Rgb_c & rgb), 0, 0, bValue, 0
#define LedCfg_RgbFlashing(ledId, rgb, rValue, gValue, bValue)  ledId, (gLedSetup_Flashing_c)|(gLedSetup_Red_c)|(gLedSetup_Green_c)|(gLedSetup_Blue_c)| (gLedSetup_Rgb_c & rgb), rValue, gValue, bValue, 0
#define LedCfg_RedChasing(ledId, rgb, rValue)                   ledId, (gLedSetup_Chasing_c)|(gLedSetup_Red_c)| (gLedSetup_Rgb_c & rgb), rValue, 0, 0, 0
#define LedCfg_GreenChasing(ledId, rgb, gValue)                 ledId, (gLedSetup_Chasing_c)|(gLedSetup_Green_c)|(gLedSetup_Rgb_c & rgb), 0, gValue, 0, 0
#define LedCfg_BlueChasing(ledId, rgb, bValue)                  ledId, (gLedSetup_Chasing_c)|(gLedSetup_Blue_c)|(gLedSetup_Rgb_c & rgb),  0, 0, bValue, 0
#define LedCfg_ColorWheel(ledId, flashPeriod)                   ledId, (gLedSetupColorWheel_c|gLedSetup_FlashPeriod_c), 0, 0, 0, flashPeriod
#else /* gLedRgbEnabled_d */
#define LedCfg_Red(ledId, rgb, rValue)                          ledId, 0, 0, 0, 0, 0
#define LedCfg_Green(ledId, rgb, gValue)                        ledId, 0, 0, 0, 0, 0
#define LedCfg_Blue(ledId, rgb, bValue)                         ledId, 0, 0, 0, 0, 0
#define LedCfg_RGB(ledId, rgb, rValue, gValue, bValue)          ledId, 0, 0, 0, 0, 0
#define LedCfg_RedFlashing(ledId, rgb, rValue)                  ledId, 0, 0, 0, 0, 0
#define LedCfg_GreenFlashing(ledId, rgb, gValue)                ledId, 0, 0, 0, 0, 0
#define LedCfg_BlueFlashing(ledId, rgb, bValue)                 ledId, 0, 0, 0, 0, 0
#define LedCfg_RgbFlashing(ledId, rgb, rValue, gValue, bValue)  ledId, 0, 0, 0, 0, 0
#define LedCfg_RedChasing(ledId, rgb, rValue)                   ledId, 0, 0, 0, 0, 0
#define LedCfg_GreenChasing(ledId, rgb, gValue)                 ledId, 0, 0, 0, 0, 0
#define LedCfg_BlueChasing(ledId, rgb, bValue)                  ledId, 0, 0, 0, 0, 0
#define LedCfg_ColorWheel(ledId, flashPeriod)                   ledId, 0, 0, 0, 0, 0
#endif /* gLedRgbEnabled_d */

/*==================================================================================================
Private type definitions
==================================================================================================*/
/* application led configuration */
typedef struct appLedConfig_tag{
  uint8_t ledId;                        /* led identifier*/
  uint8_t ledSetup;                     /* bitmap */
  uint8_t redValue;                     /* red value*/
  uint8_t greenValue;                   /* green value*/
  uint8_t blueValue;                    /* blue value */
  uint16_t flashPeriod;                 /* flashing period */
}appLedConfig_t;

