corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/nwk_ip/app/common/app_led.c
/* application leds configuration*/
typedef struct appLedsConfig_tag{
  appLedConfig_t ledConfig[gConfigLedsOnTargetBoard_c];
}appLedsConfig_t;


/* app led state */
typedef struct appLedState_tag{
  appDeviceState_t stateId;
  appLedsConfig_t *pLedsConfig;
}appLedState_t;


/*==================================================================================================
Private global variables declarations
==================================================================================================*/
#ifdef FRDM_KW24
/* FRDM_KW24 configuration mode - leds/state*/
const appLedsConfig_t gLedCfgFactoryDefault =       {LedCfg_BlueFlashing(LED_RGB, gLedSetup_Rgb_c, LED_MAX_RGB_VALUE_c), LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgJoiningOrAttaching =   {LedCfg_ColorWheel(LED_RGB, 50),                                     LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgNwkConnected =         {LedCfg_Off(LED_RGB),                                                LedCfg_Off(LED4)};
const appLedsConfig_t gLedCfgNwkOperationPending =  {LedCfg_Off(LED_RGB),                                                LedCfg_Flashing(LED4)};
#if !THREAD_ED_CONFIG
const appLedsConfig_t gLedCfgIsLeader =             {LedCfg_Green(LED_RGB, gLedSetup_Rgb_c, LED_MAX_RGB_VALUE_c),        LedCfg_On(LED4)};
const appLedsConfig_t gLedCfgIsActiveRouter =       {LedCfg_Off(LED_RGB),                                                LedCfg_On(LED4)};
#endif
/* FRDM_KW24 application mode - leds/state*/
const appLedsConfig_t gLedCfgAppLedOn =            {LedCfg_On(LED_RGB),                                                 LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedOff =           {LedCfg_Off(LED_RGB),                                                LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedToggle =        {LedCfg_Toggle(LED_RGB, gLedState_Undefined_c),                      LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedFlash =         {LedCfg_Flashing(LED_RGB),                                           LedCfg_NotUsed(LED4)};
/* app led RGB configuration -- should be in RAM - rValue, gValue, bValue could be changed by application */
appLedsConfig_t gLedCfgAppLedRgb =                 {LedCfg_RGB(LED_RGB, gLedSetup_Rgb_c, 0, 0, LED_MAX_RGB_VALUE_c),    LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedColorWheel =    {LedCfg_ColorWheel(LED_RGB, 200),         LedCfg_NotUsed(LED4)};

#elif defined(FRDM_KW41Z)

/* FRDM_KW41Z configuration mode - leds/state*/
const appLedsConfig_t gLedCfgFactoryDefault =       {LedCfg_Chasing(LED1),         /*      LedCfg_Chasing(LED2)  LedCfg_BlueFlashing(LED_RGB, gLedSetup_Rgb_c, LED_MAX_RGB_VALUE_c), LedCfg_Flashing(LED1)*/};
//const appLedsConfig_t gLedCfgFactoryDefault =       {LedCfg_Off(LED1),LedCfg_Off(LED2),LedCfg_On(LED3)};
const appLedsConfig_t gLedCfgJoiningOrAttaching =   {LedCfg_ColorWheel(LED_RGB, 50),                                     LedCfg_Flashing(LED1)};
const appLedsConfig_t gLedCfgNwkConnected =         {LedCfg_Off(LED_RGB),                                                LedCfg_Off(LED1)};
const appLedsConfig_t gLedCfgNwkOperationPending =  {LedCfg_Off(LED_RGB),                                                LedCfg_Flashing(LED1)};
#if !THREAD_ED_CONFIG
const appLedsConfig_t gLedCfgIsLeader =             {LedCfg_Green(LED_RGB, gLedSetup_Rgb_c, LED_MAX_RGB_VALUE_c),        LedCfg_On(LED1)};
#if VT_KW41Z_DEMO
const appLedsConfig_t gLedCfgIsActiveRouter =       {LedCfg_Off(LED_RGB),                                                LedCfg_Off(LED1)};
#else
const appLedsConfig_t gLedCfgIsActiveRouter =       {LedCfg_Off(LED_RGB),                                                LedCfg_On(LED1)};
#endif /* VT_KW41Z_DEMO */
#endif
/* FRDM_KW41Z application mode - leds/state*/
const appLedsConfig_t gLedCfgAppLedOn =            {LedCfg_On(LED_RGB),                                                 LedCfg_NotUsed(LED1)};
const appLedsConfig_t gLedCfgAppLedOff =           {LedCfg_Off(LED_RGB),                                                LedCfg_NotUsed(LED1)};
const appLedsConfig_t gLedCfgAppLedToggle =        {LedCfg_Toggle(LED_RGB, gLedState_Undefined_c),                      LedCfg_NotUsed(LED1)};
const appLedsConfig_t gLedCfgAppLedFlash =         {LedCfg_Flashing(LED_RGB),                                           LedCfg_NotUsed(LED1)};
/* app led RGB configuration -- should be in RAM - rValue, gValue, bValue could be changed by application */
appLedsConfig_t gLedCfgAppLedRgb =                 {LedCfg_RGB(LED_RGB, gLedSetup_Rgb_c, 0, 0, LED_MAX_RGB_VALUE_c),    LedCfg_NotUsed(LED1)};
const appLedsConfig_t gLedCfgAppLedColorWheel =    {LedCfg_ColorWheel(LED_RGB, 200),         LedCfg_NotUsed(LED1)};

#elif defined(FRDM_K64F)
/* FRDM_K64F configuration mode - leds/state*/
const appLedsConfig_t gLedCfgFactoryDefault =        {LedCfg_BlueFlashing(LED_RGB, 0, 0),                         LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgJoiningOrAttaching =    {LedCfg_ColorWheel(LED_RGB, gLedSetup_DefaultFlashPeriod_c), LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgNwkConnected =          {LedCfg_Off(LED_RGB),                                        LedCfg_Off(LED4)};
const appLedsConfig_t gLedCfgNwkOperationPending =   {LedCfg_Off(LED_RGB),                                        LedCfg_Flashing(LED4)};
#if !THREAD_ED_CONFIG
const appLedsConfig_t gLedCfgIsLeader =              {LedCfg_Green(LED_RGB, 0, 0),                                LedCfg_On(LED4)};
const appLedsConfig_t gLedCfgIsActiveRouter =        {LedCfg_NotUsed(LED_RGB),                                    LedCfg_On(LED4)};
#endif
/* FRDM_K64F application mode - leds/state*/
const appLedsConfig_t gLedCfgAppLedOn =            {LedCfg_On(LED_RGB),                                         LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedOff =           {LedCfg_Off(LED_RGB),                                        LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedToggle =        {LedCfg_Toggle(LED_RGB, gLedState_Undefined_c),              LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedFlash =         {LedCfg_Flashing(LED_RGB),                                   LedCfg_NotUsed(LED4)};
/* app led RGB configuration -- should be in RAM - rValue, gValue, bValue could be changed by application */
appLedsConfig_t gLedCfgAppLedRgb =                 {LedCfg_RGB(LED_RGB, gLedSetup_Rgb_c, 0, 0, LED_MAX_RGB_VALUE_c), LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedColorWheel =    {LedCfg_ColorWheel(LED_RGB, 200),                            LedCfg_NotUsed(LED4)};

#elif defined(FRDM_KL46Z)
/* FRDM_KL46Z configuration mode - leds/state*/
const appLedsConfig_t gLedCfgFactoryDefault =        {LedCfg_BlueFlashing(LED_RGB, 0, 0),                          LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgJoiningOrAttaching =    {LedCfg_ColorWheel(LED_RGB, 50),                              LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgNwkConnected =          {LedCfg_Off(LED_RGB),                                         LedCfg_Off(LED4)};
const appLedsConfig_t gLedCfgNwkOperationPending =   {LedCfg_Off(LED_RGB),                                         LedCfg_Flashing(LED4)};
#if !THREAD_ED_CONFIG
const appLedsConfig_t gLedCfgIsLeader =              {LedCfg_Green(LED_RGB, 0, 0),                                 LedCfg_On(LED4)};
const appLedsConfig_t gLedCfgIsActiveRouter =        {LedCfg_NotUsed(LED_RGB),                                     LedCfg_On(LED4)};
#endif
/* FRDM_KL46Z application mode - leds/state*/
const appLedsConfig_t gLedCfgAppLedOn =            {LedCfg_On(LED_RGB),                                          LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedOff =           {LedCfg_Off(LED_RGB),                                         LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedToggle =        {LedCfg_Toggle(LED_RGB, gLedState_Undefined_c),               LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedFlash =         {LedCfg_Flashing(LED_RGB),                                    LedCfg_NotUsed(LED4)};
/* app led RGB configuration -- should be in RAM - rValue, gValue, bValue could be changed by application */
appLedsConfig_t gLedCfgAppLedRgb =                 {LedCfg_RGB(LED_RGB, gLedSetup_Rgb_c, 0, 0, LED_MAX_RGB_VALUE_c),LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedColorWheel =    {LedCfg_ColorWheel(LED_RGB, 200),                             LedCfg_NotUsed(LED4)};

#elif defined(USB_KW24) || defined(USB_KW41)
/* USB-KW24D512Dongle configuration mode - leds/state*/
const appLedsConfig_t gLedCfgFactoryDefault =        {LedCfg_Flashing(LED1),              LedCfg_Flashing(LED2)};
const appLedsConfig_t gLedCfgJoiningOrAttaching =    {LedCfg_Chasing(LED1),               LedCfg_Chasing(LED2)};
const appLedsConfig_t gLedCfgNwkConnected =          {LedCfg_Off(LED1),                   LedCfg_Off(LED2)};
const appLedsConfig_t gLedCfgNwkOperationPending =   {LedCfg_Flashing(LED1),              LedCfg_Off(LED2)};
#if !THREAD_ED_CONFIG
const appLedsConfig_t gLedCfgIsLeader =              {LedCfg_On(LED1),                    LedCfg_Off(LED2)};
const appLedsConfig_t gLedCfgIsActiveRouter =        {LedCfg_On(LED1),                    LedCfg_Off(LED2)};
#endif
/* USB-KW24D512Dongle application mode - leds/state*/
const appLedsConfig_t gLedCfgAppLedOn =            {LedCfg_NotUsed(LED1),               LedCfg_On(LED2)};
const appLedsConfig_t gLedCfgAppLedOff =           {LedCfg_NotUsed(LED1),               LedCfg_Off(LED2)};
const appLedsConfig_t gLedCfgAppLedToggle =        {LedCfg_NotUsed(LED1),               LedCfg_Toggle(LED2, gLedState_Undefined_c)};
const appLedsConfig_t gLedCfgAppLedFlash =         {LedCfg_NotUsed(LED1),               LedCfg_Flashing(LED2)};
#else
/* TWR-KW24D512, TWR-KW21D256 */
/* configuration mode - leds/state*/
const appLedsConfig_t gLedCfgFactoryDefault =        {LedCfg_Flashing(LED1),        LedCfg_Flashing(LED2),            LedCfg_Flashing(LED3),            LedCfg_Flashing(LED4)};
const appLedsConfig_t gLedCfgJoiningOrAttaching =    {LedCfg_Chasing(LED1),         LedCfg_Chasing(LED2),             LedCfg_Chasing(LED3),             LedCfg_Chasing(LED4)};
const appLedsConfig_t gLedCfgNwkConnected =          {LedCfg_Off(LED1),             LedCfg_Off(LED2),                 LedCfg_Off(LED3),                 LedCfg_Off(LED4)};
const appLedsConfig_t gLedCfgNwkOperationPending =   {LedCfg_Off(LED1),             LedCfg_Off(LED2),                 LedCfg_Off(LED3),                 LedCfg_Flashing(LED4)};
#if !THREAD_ED_CONFIG
const appLedsConfig_t gLedCfgIsLeader =              {LedCfg_On(LED1),              LedCfg_NotUsed(LED2),             LedCfg_NotUsed(LED3),             LedCfg_On(LED4)};
const appLedsConfig_t gLedCfgIsActiveRouter =        {LedCfg_Off(LED1),             LedCfg_Off(LED2),                 LedCfg_Off(LED3),                 LedCfg_On(LED4)};
#endif
/* application mode - leds/state*/
const appLedsConfig_t gLedCfgAppLedOn =            {LedCfg_NotUsed(LED1),         LedCfg_NotUsed(LED2),             LedCfg_On(LED3),                  LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedOff =           {LedCfg_NotUsed(LED1),         LedCfg_NotUsed(LED2),             LedCfg_Off(LED3),                 LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedToggle =        {LedCfg_NotUsed(LED1),         LedCfg_NotUsed(LED2),             LedCfg_Toggle(LED3, gLedState_Undefined_c),LedCfg_NotUsed(LED4)};
const appLedsConfig_t gLedCfgAppLedFlash =         {LedCfg_NotUsed(LED1),         LedCfg_NotUsed(LED2),             LedCfg_Flashing(LED3),            LedCfg_NotUsed(LED4)};

