corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/nwk_ip/app/common/app_led.c
#endif /* FRDM_K64F */


const appLedState_t gLedConfigState[] = {
  {gDeviceState_FactoryDefault_c,        (appLedsConfig_t *)&gLedCfgFactoryDefault},
  {gDeviceState_JoiningOrAttaching_c,    (appLedsConfig_t *)&gLedCfgJoiningOrAttaching},
  {gDeviceState_NwkOperationPending_c,   (appLedsConfig_t *)&gLedCfgNwkOperationPending},
#if !THREAD_ED_CONFIG
  {gDeviceState_Leader_c,                (appLedsConfig_t *)&gLedCfgIsLeader},
  {gDeviceState_ActiveRouter_c,          (appLedsConfig_t *)&gLedCfgIsActiveRouter},
#endif
  {gDeviceState_NwkConnected_c,          (appLedsConfig_t *)&gLedCfgNwkConnected},
  {gDeviceState_NwkFailure_c,            (appLedsConfig_t *)&gLedCfgNwkOperationPending}
};

const appLedState_t gLedAppState[] = {
  {gDeviceState_AppLedOn_c,              (appLedsConfig_t *)&gLedCfgAppLedOn},
  {gDeviceState_AppLedOff_c,             (appLedsConfig_t *)&gLedCfgAppLedOff},
  {gDeviceState_AppLedToggle_c,          (appLedsConfig_t *)&gLedCfgAppLedToggle},
  {gDeviceState_AppLedFlash_c,           (appLedsConfig_t *)&gLedCfgAppLedFlash},
#if gLedRgbEnabled_d
  {gDeviceState_AppLedRgb_c,             (appLedsConfig_t *)&gLedCfgAppLedRgb},
  {gDeviceState_AppLedColorWheel_c,      (appLedsConfig_t *)&gLedCfgAppLedColorWheel},
#endif
#if !THREAD_ED_CONFIG
  {gDeviceState_Leader_c,                (appLedsConfig_t *)&gLedCfgIsLeader},
  {gDeviceState_ActiveRouter_c,          (appLedsConfig_t *)&gLedCfgIsActiveRouter},
#endif
  {gDeviceState_JoiningOrAttaching_c,    (appLedsConfig_t *)&gLedCfgJoiningOrAttaching}
};

/*==================================================================================================
Public global variables declarations
==================================================================================================*/

/* 802.15.4 - LED tx activity variables:*/
bool_t gEnable802154TxLed = FALSE;
bool_t gEnableTxLed = FALSE;
bool_t routerLedState = FALSE;

#if (AT_COMMAND_SHELL)
appLedsConfig_t m_sATLeds;
const appLedState_t m_sATSetLedCfg = {0xFF, &m_sATLeds};
#endif //(AT_COMMAND_SHELL)

/*==================================================================================================
Private function prototypes
==================================================================================================*/
static appLedState_t* LedState_GetEntry(appDeviceMode_t devModeId, appDeviceState_t devStateId);
static void LedConfig_SetState(appLedState_t *pStateLedCfg);
/*==================================================================================================
Public functions
==================================================================================================*/
/*!*************************************************************************************************
\public
\fn  void Led_SetState(appDeviceMode_t devModeId, appDeviceState_t devStateId)
\brief set LEDs based on device modeId/stateId

\param [in]   devModeId                 device mode id
\param [in]   devStateId                device state id
 ***************************************************************************************************/
void Led_SetState(appDeviceMode_t devModeId, appDeviceState_t devStateId)
{
    /* configure leds */
#if (AT_COMMAND_SHELL)
	if (APP_LedKeyboardStatusGet() == atkAUTO)
#endif //(AT_COMMAND_SHELL)
	{
		LedConfig_SetState(LedState_GetEntry(devModeId, devStateId));
	}
}

#if (AT_COMMAND_SHELL)
void LedSetATConfig(uint8_t red, uint8_t green, uint8_t blue)
{
	if (blue != 0xFF)
	{
		m_sATLeds.ledConfig[0].ledId = LED1;
		m_sATLeds.ledConfig[0].ledSetup = (blue)? gLedSetup_On_c : 0;
		m_sATLeds.ledConfig[0].redValue = 0;
		m_sATLeds.ledConfig[0].greenValue = 0;
		m_sATLeds.ledConfig[0].blueValue = 0;
		m_sATLeds.ledConfig[0].flashPeriod = 0;
	}

	if (red != 0xFF)
	{
		m_sATLeds.ledConfig[1].ledId = LED2;
		m_sATLeds.ledConfig[1].ledSetup = (red)? gLedSetup_On_c : 0;
		m_sATLeds.ledConfig[1].redValue = 0;
		m_sATLeds.ledConfig[1].greenValue = 0;
		m_sATLeds.ledConfig[1].blueValue = 0;
		m_sATLeds.ledConfig[1].flashPeriod = 0;
	}

	if (green != 0xFF)
	{
		m_sATLeds.ledConfig[2].ledId = LED3;
		m_sATLeds.ledConfig[2].ledSetup = (green)? gLedSetup_On_c : 0;
		m_sATLeds.ledConfig[2].redValue = 0;
		m_sATLeds.ledConfig[2].greenValue = 0;
		m_sATLeds.ledConfig[2].blueValue = 0;
		m_sATLeds.ledConfig[2].flashPeriod = 0;
	}

	LedConfig_SetState((appLedState_t*)&m_sATSetLedCfg);
}
#endif //(AT_COMMAND_SHELL)

#if gLedRgbEnabled_d
/*!*************************************************************************************************
\public
\fn  void Led_UpdateRgbState(uint8_t redValue, uint8_t greenValue, uint8_t blueValue)
\brief set RGB LEDs based on input values for red, green and blue

\param [in]    redValue      Red value
\param [in]    greenValue    Green value
\param [in]    blueValue     Blue value
 ***************************************************************************************************/
void Led_UpdateRgbState
(
    uint8_t redValue,
    uint8_t greenValue,
    uint8_t blueValue
)
{
    /* update rgb values */
    for(uint8_t i=0; i< gConfigLedsOnTargetBoard_c; i++)
    {
        if(gLedCfgAppLedRgb.ledConfig[i].ledId == LED_RGB)
        {
            gLedCfgAppLedRgb.ledConfig[i].redValue = redValue;
            gLedCfgAppLedRgb.ledConfig[i].greenValue = greenValue;
            gLedCfgAppLedRgb.ledConfig[i].blueValue = blueValue;
        }
    }
}
#endif

/*!*************************************************************************************************
\fn     void Led_MacTxOn(void)
\brief  Function used to set LED On (80215.4 tx activity)
***************************************************************************************************/
void Led_MacTxOn
(
    void
)
{
    OSA_InterruptDisable();
    if(gEnable802154TxLed && (!gEnableTxLed))
    {
        gEnableTxLed = TRUE;
        if(routerLedState)
        {
            AppTxLedActivityOff();
        }
        else
        {
            AppTxLedActivityOn();
        }
    }
    OSA_InterruptEnable();
}

