corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/nwk_ip/app/common/app_led.c
/*!*************************************************************************************************
\fn     void Led_MacTxOff(void)
\brief  Function used to set LED Off (80215.4 tx activity)
***************************************************************************************************/
void Led_MacTxOff
(
    void
)
{
    OSA_InterruptDisable();
    if(gEnable802154TxLed || gEnableTxLed)
    {
        if(routerLedState)
        {
            AppTxLedActivityOn();
        }
        else
        {
            AppTxLedActivityOff();
        }
        gEnableTxLed = FALSE;
    }
    OSA_InterruptEnable();
}

/*!*************************************************************************************************
\fn     void Led_Identify(bool_t state)
\brief  This function is used to start the board identification by flashing the TX LED.

\param  [in]    state      Variable used to toggle the identification process
***************************************************************************************************/
void Led_Identify
(
    bool_t state
)
{
    if(state == TRUE)
    {
        Led_PeriodFlash(LED_TX_ACTIVITY, 500);
    }
    else
    {
        Led_TurnOff(LED_TX_ACTIVITY);
    }
}

/*==================================================================================================
Private functions
==================================================================================================*/

/*!*************************************************************************************************
\private
\fn static appLedState_t* LedState_GetEntry(appDeviceState_t devStateId)
\brief Get led configuration entry

\param [in]   devModeId                 device mode identifier
       [in]   devStateId                device state identifier

\return       appLedState_t             pointer to led state structure
 ***************************************************************************************************/
static appLedState_t* LedState_GetEntry
(
    appDeviceMode_t devModeId,
    appDeviceState_t devStateId
)
{
    appLedState_t *pResult = NULL;
    appLedState_t *pLedState = (appLedState_t *)&gLedConfigState[0];
    uint8_t noElements = NumberOfElements(gLedConfigState);

    if(devModeId == gDeviceMode_Application_c)
    {
        noElements = NumberOfElements(gLedAppState);
        pLedState = (appLedState_t *)&gLedAppState[0];
    }

    for(uint8_t i = 0; i< noElements; i++)
    {
        if(devStateId == pLedState[i].stateId)
        {
            pResult = (appLedState_t *)&pLedState[i];
            break;
        }
    }

    return pResult;
}

/*!*************************************************************************************************
\private
\fn static void LedConfig_SetState(appLedState_t *pStateLedCfg)
\brief Set led configuration

\param [in]   pStateLedCfg     pointer to led configuration
 ***************************************************************************************************/
static void LedConfig_SetState
(
    appLedState_t *pStateLedCfg
)
{
    uint8_t i;
    uint8_t startLedChasing = gLedId_Undefined_c;
    uint16_t flashInterval = gLedSetup_DefaultFlashPeriod_c;
#if gLedRgbEnabled_d
    uint8_t redValue = 0, greenValue = 0, blueValue = 0;
    bool_t bSetRgb = FALSE;
#endif
    if(!pStateLedCfg)
    {
        return;
    }

    for(i=0; i< gConfigLedsOnTargetBoard_c; i++)
    {
        /* validate LedId */
        if(pStateLedCfg->pLedsConfig->ledConfig[i].ledId != gLedId_Undefined_c)
        {
            /* application toggle state */
            if(pStateLedCfg->stateId == gDeviceState_AppLedToggle_c)
            {
                /* toggle the led */
                Led_Toggle(pStateLedCfg->pLedsConfig->ledConfig[i].ledId);
            }
            else
            {
                /* on/off led */
                if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_On_c)
                {
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledId == LED_TX_ACTIVITY)
                    {
                        routerLedState = TRUE;
                    }
                    /* turn On the led */
                    Led_TurnOn(pStateLedCfg->pLedsConfig->ledConfig[i].ledId);
                }
                else
                {
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledId == LED_TX_ACTIVITY)
                    {
                        routerLedState = FALSE;
                    }
                    /* turn off the led */
                    Led_TurnOff(pStateLedCfg->pLedsConfig->ledConfig[i].ledId);
                }
 #if gLedRgbEnabled_d
                /* should be Red? */
                if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Red_c)
                {
                    redValue = LED_MAX_RGB_VALUE_c;
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Rgb_c)
                    {
                        redValue = pStateLedCfg->pLedsConfig->ledConfig[i].redValue;
                    }
                    bSetRgb = TRUE;
                }
                 /* should be Green? */
                if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Green_c)
                {
                    greenValue = LED_MAX_RGB_VALUE_c;
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Rgb_c)
                    {
                        greenValue = pStateLedCfg->pLedsConfig->ledConfig[i].greenValue;
                    }
                    bSetRgb = TRUE;
                }
                /* should be Blue? */
                if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Blue_c)
                {
                    blueValue = LED_MAX_RGB_VALUE_c;
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Rgb_c)
                    {
                        blueValue = pStateLedCfg->pLedsConfig->ledConfig[i].blueValue;
                    }
                    bSetRgb = TRUE;
                }
                /* set rgb led */
                if(bSetRgb)
                {
                     Led_RGB(pStateLedCfg->pLedsConfig->ledConfig[i].ledId, redValue, greenValue, blueValue);
                }

 #endif
 #if gLedRgbEnabled_d
                /* color wheel? */
                if((pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetupColorWheel_c) ==
                   gLedSetupColorWheel_c)
                {
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_FlashPeriod_c)
                    {
                        flashInterval = pStateLedCfg->pLedsConfig->ledConfig[i].flashPeriod;
                    }
                    LED_ColorWheel(pStateLedCfg->pLedsConfig->ledConfig[i].ledId, flashInterval);
                }
                else
#endif
                {
                    /* flashing? */
                    if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Flashing_c)
                    {
                        if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_FlashPeriod_c)
                        {
                            flashInterval = pStateLedCfg->pLedsConfig->ledConfig[i].flashPeriod;
                        }
                        Led_PeriodFlash(pStateLedCfg->pLedsConfig->ledConfig[i].ledId, flashInterval);
                    }
                    /* chasing? */
                    else if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_Chasing_c)
                    {
                        if(startLedChasing > pStateLedCfg->pLedsConfig->ledConfig[i].ledId )
                        {
                            startLedChasing = pStateLedCfg->pLedsConfig->ledConfig[i].ledId;
                            if(pStateLedCfg->pLedsConfig->ledConfig[i].ledSetup & gLedSetup_FlashPeriod_c)
                            {
                                flashInterval = pStateLedCfg->pLedsConfig->ledConfig[i].flashPeriod;
                            }
                        }
                    }
                }
            }
        }
    }

    if(startLedChasing != gLedId_Undefined_c)
    {
        Led_Chasing(startLedChasing, flashInterval);
    }
}

/*==================================================================================================
Private debug functions
==================================================================================================*/
